In [4]:
import numpy as np
import pandas as pd
import os

In [2]:
print("task-1")
print()

number = 158   #"Type a number here"
base =  16    #"Type the desired base here"
digits = "0123456789abcdef"
number = int(number)
base= int(base)
finalenum = ""
while 1:
    number = int(number)
    base= int(base)
    r = number%base
    finalenum = digits[r]+finalenum
    number = (number//base)
    if number==0:
        break 

    
print(finalenum)

task-1

9e

In [5]:
df=pd.read_csv(r"C:\Users\user\Desktop\דניאל\דניאל לימודים\אוניברסיטה\עבודת גמר\cast.csv")
df.shape 
print("task-2")
is_hamlet = df['title']=='Hamlet'
hamlet = df[is_hamlet]
hamlet.head(299)

task-2

          title  year              name     type              character     n
1456     Hamlet  1996        Riz Abbasi    actor  Attendant to Claudius   1.0
6710     Hamlet  1921  Fritz Achterberg    actor            Fortinbras,   9.0
10274    Hamlet  2009      Hayden Adams    actor                Laertes   7.0
10275    Hamlet  2009      Hayden Adams    actor                 Player   7.0
12743    Hamlet  1913       Eric Adeney    actor               Reynaldo  14.0
...         ...   ...               ...      ...                    ...   ...
3212647  Hamlet  1964      Carol Teitel  actress                   Lady   NaN
3236803  Hamlet  1969    Jennifer Tudor  actress             Court lady  23.0
3257437  Hamlet  2000      Diane Venora  actress               Gertrude   3.0
3284728  Hamlet  1996     Perdita Weeks  actress          Second Player  44.0
3304265  Hamlet  1996      Kate Winslet  actress                Ophelia  46.0

[299 rows x 6 columns]

In [6]:
print("task 3")
hamlet_year = hamlet['year']==1921
hamlet_1921 = hamlet[hamlet_year]
hamlet_1921.head()

task 3

          title  year              name   type     character    n
6710     Hamlet  1921  Fritz Achterberg  actor   Fortinbras,  9.0
408456   Hamlet  1921      Paul Conradi  actor  K?nig Hamlet  2.0
495468   Hamlet  1921  Anton De Verdier  actor       Laertes  7.0
1015046  Hamlet  1921   Hans Junkermann  actor      Polonius  6.0
1948795  Hamlet  1921      Heinz Stieda  actor       Horatio  5.0

In [ ]:
hamlet groupbygggg

In [14]:
year=df['year']
lnum= year%10
fnum= year-lnum
fnum.head()

0    1980
1    2000
2    1990
3    2000
4    2010
Name: year, dtype: int64

In [114]:
#hamlet.groupby(level="year").sum()

In [18]:
a=hamlet.groupby(by=["year"]).sum()
a.head(10)
b=a.groupby(by=["year"]).sum()
b.head(30)

<bound method DataFrame.info of            n
year
1910     0.0
1911    21.0
1913   216.0
1921    45.0
1948   166.0
1954     1.0
1964    28.0
1969   287.0
1973     0.0
1976    42.0
1987     0.0
1990   378.0
1996  1128.0
2000   744.0
2009   105.0
2011     6.0
2015    17.0>

In [22]:
a=hamlet.groupby(by=["year"]).sum()
a.head(10)
year=df['year']
lnum= year%10
fnum= year-lnum 
fnum.head()

0    1980
1    2000
2    1990
3    2000
4    2010
Name: year, dtype: int64

In [11]:
hamlet['sold'] = True

<ipython-input-11-44f3623a2d37>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hamlet['sold'] = True

In [ ]:
hamlet.groupby(by=["year"]).sum()

In [13]:
year=a['year']
#lnum= year%10
#fnum= year-lnum
#fnum.head(10)

KeyError: 'year'

In [19]:
hamlet_dec = hamlet[['year', 'name']]
hamlet_dec.head()

       year              name
1456   1996        Riz Abbasi
6710   1921  Fritz Achterberg
10274  2009      Hayden Adams
10275  2009      Hayden Adams
12743  1913       Eric Adeney

In [ ]:
hamlet_dec = hamlet[['year', 'name']]
hamlet_dec.head()
year=df['year']
lnum= year%10
fnum= year-lnum
fnum.head()

In [17]:
hamlet20 = hamlet[(hamlet.year > 1919) & (hamlet.year <= 1929)]
hamlet20.head()
a=hamlet20.groupby(by=["year"]).sum()
a.head(10)

         n
year
1921  45.0

In [70]:
a=df['year'] == 2020
b=df[a]
b.head()

,title,year,name,type,character,n
380346,The Lovaganza Convoy: Part 3 - The New World,2020,Nick (VII) Clark,actor,Joseph Levi,2.0
454726,The Property of a Lady Fan Film,2020,Paul (II) Cusack,actor,James Bond,NaN
477035,Cranium Intel: Magnetism X.3,2020,Hardley Davidson,actor,President Scott Collins,NaN
477916,The End of the World: Volume I,2020,Anthony (VII) Davies,actor,Vincent Magnolias,5.0
480751,Back to the Saddle 2,2020,Jaylen Davis,actor,Aaron Russel,1.0

In [90]:
a=df['year'] >= 1990
b=df[a]
b.head()

                               title  year       name   type character     n
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN
5                            Townbiz  2010  Too $hort  actor   Himself   NaN

In [19]:
print("task-7")
is_frank = df['name']=='Frank oz'
frank = df[is_frank]
frank.head()

task-7

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

In [21]:
a=df['name'] == 'Frank Oz'
b=df[a]
b.head(10)

,title,year,name,type,character,n
1538776,An American Werewolf in London,1981,Frank Oz,actor,Mr. Collins,13.0
1538777,An American Werewolf in London,1981,Frank Oz,actor,Miss Piggy,13.0
1538778,Blues Brothers 2000,1998,Frank Oz,actor,Warden,4.0
1538779,Innocent Blood,1992,Frank Oz,actor,Pathologist,21.0
1538780,Inside Out,2015,Frank Oz,actor,Subconscious Guard Dave,14.0
1538781,Labyrinth,1986,Frank Oz,actor,The Wiseman,17.0
1538782,"Monsters, Inc.",2001,Frank Oz,actor,Fungus,9.0
1538783,Muppet Treasure Island,1996,Frank Oz,actor,Miss Piggy,14.0
1538784,Muppet Treasure Island,1996,Frank Oz,actor,Fozzie Bear,14.0
1538785,Muppet Treasure Island,1996,Frank Oz,actor,Sam the Eagle,14.0

In [22]:
title = b[['title']]
title.head()

                                  title
1538776  An American Werewolf in London
1538777  An American Werewolf in London
1538778             Blues Brothers 2000
1538779                  Innocent Blood
1538780                      Inside Out